Repository: wasimmostakim2965-ui/openclaw-windows-node
Catalog: src/OpenClaw.Tray.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, pt_br, zh_cn, zh_tw

# Menu_SessionsFormat
source: Sessions ({0})
fr_fr: Séances ({0})
pt_br: Sessões ({0})
zh_cn: 会话 ({0})
zh_tw: 會話 ({0})

# Menu_NodesFormat
source: Nodes ({0})
fr_fr: Nœuds ({0})
pt_br: Nós ({0})
zh_cn: 节点 ({0})
zh_tw: 節點 ({0})

# Menu_RecentActivityFormat
source: Recent Activity ({0})
fr_fr: Activité récente ({0})
pt_br: Atividade recente ({0})
zh_cn: 最近活动 ({0})
zh_tw: 最近活動 ({0})

# Menu_NoUsageData
source: No usage data
fr_fr: Aucune utilisation des données
pt_br: Nenhum dado de uso
zh_cn: 暂无用量数据
zh_tw: 暫無用量數據

# Menu_ResetSession
source: ↳ Reset session
fr_fr: ↳ Réinitialiser les sessions
pt_br: ↳ Redefinir sessão
zh_cn: ↳ 重置会话
zh_tw: ↳ 重置會話

# Menu_CompactLog
source: ↳ Compact log
fr_fr: ↳ Compresser les fichiers de journalisation
pt_br: ↳ Compactar log
zh_cn: ↳ 压缩日志
zh_tw: ↳ 壓縮日誌

# Menu_DeleteSession
source: ↳ Delete session
fr_fr: ↳ Supprimer la session
pt_br: ↳ Excluir sessão
zh_cn: ↳ 删除会话
zh_tw: ↳ 刪除會話

# Menu_NodeWaitingApproval
source: ⏳ Waiting for approval...
fr_fr: ⏳ En attente de validation...
pt_br: ⏳ Aguardando aprovação...
zh_cn: ⏳ 等待批准...
zh_tw: ⏳ 等待批準...

# Menu_NodePairedConnected
source: ✅ Paired & Connected
fr_fr: ✅ Associé & Connecté
pt_br: ✅ Pareado & Conectado
zh_cn: ✅ 已配对并连接
zh_tw: ✅ 已配對並連線

# Menu_NodeConnecting
source: 🔄 Connecting...
fr_fr: 🔄 En cours de connexion...
pt_br: 🔄 Conectando
zh_cn: 🔄 连接中...
zh_tw: 🔄 連線中...

# Menu_NodeDisconnected
source: ⚪ Disconnected
fr_fr: ⚪ Déconnecté
pt_br: ⚪ Desconectado
zh_cn: ⚪ 已断开
zh_tw: ⚪ 中斷連線

# TestNotification_Title
source: Test Notification
fr_fr: Test de notifications
pt_br: Notificação de teste
zh_cn: 测试通知
zh_tw: 測試通知

# TestNotification_Body
source: This is a test notification from OpenClaw Tray.
fr_fr: Ceci est une notifications de test provenant de OpenClaw Tray.
pt_br: Esta é uma notificação de teste do OpenClaw Tray.
zh_cn: 这是来自 OpenClaw 托盘的测试通知。
zh_tw: 這是來自 OpenClaw 設定的測試通知。

# Status_LastCheckFormat
source: Last check: {0}
fr_fr: Dernière vérification : {0}
pt_br: Última verificação {0}
zh_cn: 上次检查: {0}
zh_tw: 上次檢查: {0}

# TimeAgo_JustNow
source: Just now
fr_fr: Maintenant
pt_br: Agora mesmo
zh_cn: 刚刚
zh_tw: 剛剛

# TimeAgo_MinutesFormat
source: {0}m ago
fr_fr: Il y a {0}m
pt_br: há {0} min
zh_cn: {0}分钟前
zh_tw: {0}分鐘前

# TimeAgo_HoursFormat
source: {0}h ago
fr_fr: Il y a {0}h
pt_br: há {0} h
zh_cn: {0}小时前
zh_tw: {0}小時前

# Activity_ClickToOpen
source: Click to open in dashboard
fr_fr: Cliquez pour ouvrir le tableau de bord
pt_br: Clique para abrir no painel
zh_cn: 点击在仪表板中打开
zh_tw: 點選在儀表板中打開

# TimeAgo_DaysFormat
source: {0}d ago
fr_fr: Il y a {0}j
pt_br: há {0} d
zh_cn: {0}天前
zh_tw: {0}天前

# StatusDisplay_Connected
source: Connected
fr_fr: Connecté
pt_br: Conectado
zh_cn: 已连接
zh_tw: 已連線

# StatusDisplay_Connecting
source: Connecting
fr_fr: En cours de connexion
pt_br: Conectando
zh_cn: 正在连接
zh_tw: 正在連線

# StatusDisplay_Disconnected
source: Disconnected
fr_fr: Déconnecté
pt_br: Desconectado
zh_cn: 已断开
zh_tw: 中斷連線

# StatusDisplay_Error
source: Error
fr_fr: Erreur
pt_br: Erro
zh_cn: 错误
zh_tw: 錯誤

# StatusDisplay_Unknown
source: Unknown
fr_fr: Inconnu
pt_br: Desconhecido
zh_cn: 未知
zh_tw: 未知

# Status_NotAvailable
source: n/a
fr_fr: Indisponible
pt_br: n/d
zh_cn: 无
zh_tw: 無

# WindowTitle_Canvas
source: Canvas
fr_fr: Canevas
pt_br: Tela do Canvas
zh_cn: 画布
zh_tw: 畫布

# CanvasErrorTitle.Text
source: ❌ Canvas Error
fr_fr: ❌ Erreur du Canvas
pt_br: ❌ Erro do Canvas
zh_cn: ❌ 画布错误
zh_tw: ❌ Canvas錯誤

# CanvasRetryButton.Content
source: Retry
fr_fr: Réessayer
pt_br: Tentar novamente
zh_cn: 重试
zh_tw: 重試

# Canvas_ReadyTitle
source: 🎨 Canvas Ready
fr_fr: 🎨 Canvas prêt
pt_br: 🎨 Canvas pronto
zh_cn: 🎨 画布就绪
zh_tw: 🎨 Canvas就緒

# Canvas_WaitingForContent
source: Waiting for content...
fr_fr: En attente de contenu...
pt_br: Aguardando conteúdo
zh_cn: 等待内容...
zh_tw: 等待內容...

# A2UI_CanvasTitle
source: Canvas
fr_fr: Canevas
pt_br: Tela do Canvas
zh_cn: 画布
zh_tw: 畫布

# A2UI_TabFallback
source: Tab
fr_fr: Onglet
pt_br: Aba
zh_cn: 选项卡
zh_tw: 索引標籤

# A2UI_ModalClose
source: Close
fr_fr: Fermer
pt_br: Fechar
zh_cn: 关闭
zh_tw: 關閉

# A2UI_DateTimeSelectDate
source: Select date
fr_fr: Sélectionner une date
pt_br: Selecionar data
zh_cn: 选择日期
zh_tw: 選擇日期

# A2UI_MultipleChoiceSelect
source: Select...
fr_fr: Sélectionner...
pt_br: Selecionar...
zh_cn: 选择...
zh_tw: 選擇...

# A2UI_UnsupportedComponent
source: Unsupported component: {0}
fr_fr: Composant non pris en charge : {0}
pt_br: Componente não compatível: {0}
zh_cn: 不支持的组件: {0}
zh_tw: 不支援的元件: {0}

# WebChatErrorTitle.Text
source: Web Chat Unavailable
fr_fr: Chat indisponible
pt_br: Web Chat indisponível
zh_cn: 网页聊天不可用
zh_tw: 網頁聊天不可用

# WebChatOpenBrowserButton.Content
source: Open in Browser Instead
fr_fr: Ouvrir dans un navigateur à la place
pt_br: Abrir no navegador
zh_cn: 在浏览器中打开
zh_tw: 在瀏覽器中打開

# WebChat_ConnectionError
source: Can't reach OpenClaw Gateway
fr_fr: Impossible d'atteindre la passerelle OpenClaw
pt_br: Não foi possível conectar ao Gateway do OpenClaw
zh_cn: 无法连接到 OpenClaw 网关
zh_tw: 無法連線到 OpenClaw 閘道器

# WebChat_ConnectionErrorDetail
source: The gateway at {0} is not responding. To connect: • Make sure your OpenClaw gateway is running • If remote, connect via VPN to your home network • Or use SSH tunnel: ssh -N -L 18789:localhost:18789 your-server
fr_fr: La passerelle à {0} ne répond pas. Pour vous connecter : • Assurez-vous que votre passerelle OpenClaw est en cours d'exécution • Si vous êtes à distance, connectez-vous via VPN à votre réseau domestique • Ou utilisez un tunnel SSH : ssh -N -L 18789:localhost:18789 votre-serveur
pt_br: O Gateway em {0} não está respondendo. Para conectar: • Verifique se o Gateway do OpenClaw está em execução • Se for remoto, conecte-se à sua rede doméstica via VPN • Ou use um túnel SSH: ssh -N -L 18789:localhost:18789 seu-servidor
zh_cn: 网关 {0} 没有响应。 连接方法： • 确保 OpenClaw 网关正在运行 • 如果是远程网关，请通过 VPN 连接到您的家庭网络 • 或使用 SSH 隧道：ssh -N -L 18789:localhost:18789 your-server
zh_tw: 閘道器 {0} 沒有響應。 連線方法： • 確保 OpenClaw 閘道器正在執行 • 如果是遠端閘道器，請通過 VPN 連線到您的家庭網路 • 或使用 SSH 隧道：ssh -N -L 18789:localhost:18789 your-server

# WebChat_CertError
source: The gateway HTTPS certificate is not trusted. To connect securely: • Use an HTTPS gateway URL (for example: https://host.tailnet.ts.net) • If self-signed, import the cert into Windows Trusted Root Certification Authorities • Or use SSH tunnel to localhost and keep using localhost URLs
fr_fr: Le certificat HTTPS de la passerelle n'est pas approuvé. Pour une connexion sécurisée : • Utilisez une URL de passerelle HTTPS (par exemple : https://host.tailnet.ts.net) • S'il est auto-signé, importez le certificat dans les Autorités de certification racines de confiance de Windows • Ou utilisez un tunnel SSH vers localhost et continuez d'utiliser les URL localhost
pt_br: O certificado HTTPS do Gateway não é confiável. Para conectar com segurança: • Use uma URL de Gateway HTTPS (por exemplo: https://host.tailnet.ts.net) • Se for autoassinado, importe o certificado na lista de Autoridades de Certificação Raiz Confiáveis do Windows • Ou use um túnel SSH para localhost e continue usando URLs localhost
zh_cn: 网关 HTTPS 证书不受信任。 安全连接方法： • 使用 HTTPS 网关地址（例如：https://host.tailnet.ts.net） • 如果是自签名证书，请将其导入 Windows 受信任的根证书颁发机构 • 或使用 SSH 隧道连接到 localhost 并继续使用 localhost 地址
zh_tw: 閘道器 HTTPS 證書不受信任。 安全連線方法： • 使用 HTTPS 閘道器地址（例如：https://host.tailnet.ts.net） • 如果是自簽名證書，請將其匯入 Windows 受信任的根證書頒發機構 • 或使用 SSH 隧道連線到 localhost 並繼續使用 localhost 地址

# WebChat_InvalidUrl
source: Invalid gateway URL: {0}
fr_fr: URL de passerelle invalide : {0}
pt_br: URL do Gateway inválida: {0}
zh_cn: 无效的网关地址: {0}
zh_tw: 無效的閘道器地址: {0}

# WebChat_SecureContextRequired
source: Web chat requires a secure context. There is no safe bypass for remote plain HTTP: browsers and WebView enforce this. Use one of these options: • Use a trusted HTTPS/WSS endpoint (Let's Encrypt, Tailscale Serve, Caddy) • If self-signed, import your gateway CA/cert into Windows Trusted Root (certmgr.msc) • Or tunnel to localhost: ssh -N -L 18789:localhost:18789 <server>
fr_fr: Le chat web nécessite un contexte sécurisé. Il n'existe aucun moyen de contournement sûr pour le HTTP simple à distance : les navigateurs et WebView l'imposent. Utilisez l'une de ces options : • Utilisez un point de terminaison HTTPS/WSS de confiance (Let's Encrypt, Tailscale Serve, Caddy) • S'il est auto-signé, importez l'AC/le certificat de votre passerelle dans les Autorités de certification racines de confiance de Windows (certmgr.msc) • Ou utilisez un tunnel vers localhost : ssh -N -L 18789:localhost:18789 <serveur>
pt_br: O Web Chat requer um contexto seguro. Não existe uma forma segura de ignorar essa exigência para HTTP remoto sem criptografia: os navegadores e o WebView impõem essa regra. Use uma destas opções: • Use um endpoint HTTPS/WSS confiável (Let's Encrypt, Tailscale Serve, Caddy) • Se for autoassinado, importe a CA/o certificado do Gateway para as Autoridades de Certificação Raiz Confiáveis do Windows (certmgr.msc) • Ou faça um túnel para localhost: ssh -N -L 18789:localhost:18789 <servidor>
zh_cn: 网页聊天需要安全上下文。 远程纯 HTTP 没有安全的绕过方法：浏览器和 WebView 强制执行此限制。 请使用以下选项之一： • 使用受信任的 HTTPS/WSS 端点（Let's Encrypt、Tailscale Serve、Caddy） • 如果是自签名证书，请将网关 CA/证书导入 Windows 受信任的根证书（certmgr.msc） • 或通过隧道连接到 localhost：ssh -N -L 18789:localhost:18789 <服务器>
zh_tw: 網頁聊天需要安全上下文。 遠端純 HTTP 沒有安全的繞過方法：瀏覽器和 WebView 強制執行此限制。 請使用以下選項之一： • 使用受信任的 HTTPS/WSS 端點（Let's Encrypt、Tailscale Serve、Caddy） • 如果是自簽名證書，請將閘道器 CA/證書匯入 Windows 受信任的根證書（certmgr.msc） • 或通過隧道連線到 localhost：ssh -N -L 18789:localhost:18789 <伺服器>

# WindowTitle_TrayMenu
source: OpenClaw Menu
fr_fr: Menu OpenClaw
pt_br: Menu do OpenClaw
zh_cn: OpenClaw 菜单
zh_tw: OpenClaw 選項

# Toast_DeviceIdCopied
source: 📋 Device ID Copied
fr_fr: 📋 Identifiant de la machine copié
pt_br: 📋 ID do dispositivo copiado
zh_cn: 📋 设备 ID 已复制
zh_tw: 📋 裝置 ID 已複製

# Toast_DeviceIdCopiedDetail
source: Run: openclaw devices approve {0}...
fr_fr: Exécutez: openclaw devices approve {0}...
pt_br: Execute: openclaw devices approve {0}...
zh_cn: 运行: openclaw devices approve {0}...
zh_tw: 執行: openclaw devices approve {0}...

# Toast_NodeSummaryCopied
source: 📋 Node summary copied
fr_fr: 📋 Résumé du nœud copié
pt_br: 📋 Resumo do Node copiado
zh_cn: 📋 节点摘要已复制
zh_tw: 📋 節點摘要已複製

# Toast_NodeSummaryCopiedDetail
source: {0} node(s) copied to clipboard
fr_fr: {0} nœud(s) copiés dans le presse papier
pt_br: {0} Node(s) copiado(s) para a área de transferência
zh_cn: 已复制 {0} 个节点到剪贴板
zh_tw: 已複製 {0} 個節點到剪貼簿

# Toast_SessionActionFailed
source: ❌ Session action failed
fr_fr: ❌ Action de session échouée
pt_br: ❌ Falha ao executar ação na sessão
zh_cn: ❌ 会话操作失败
zh_tw: ❌ 會話操作失敗

# Toast_SessionActionFailedDetail
source: Could not send request to gateway.
fr_fr: Impossible d'envoyer une requête vers la passerelle.
pt_br: Não foi possível enviar a solicitação ao Gateway.
zh_cn: 无法向网关发送请求。
zh_tw: 無法向閘道器發送請求。

# Toast_NodeModeActive
source: 🔌 Node Mode Active
fr_fr: 🔌 Mode de noeud actif
pt_br: 🔌 Modo Node ativo
zh_cn: 🔌 节点模式已激活
zh_tw: 🔌 節點模式已啟用

# Toast_NodeModeActiveDetail
source: This PC can now receive commands from the agent (canvas, screenshots)
fr_fr: Ce PC peut désormais recevoir des commandes de l'agent (canvas, captures d'écran)
pt_br: Este PC agora pode receber comandos do agente (Canvas, capturas de tela)
zh_cn: 此电脑现在可以接收来自代理的命令（画布、截图）
zh_tw: 此電腦現在可以接收來自代理的命令（Canvas、截圖）

# Toast_PairingPending
source: ⏳ Awaiting Pairing Approval
fr_fr: ⏳ En attente de l'approbation de l'appairage
pt_br: ⏳ Aguardando aprovação do pareamento
zh_cn: ⏳ 等待配对批准
zh_tw: ⏳ 等待配對批準

# Toast_PairingPendingDetail
source: Run on gateway: openclaw devices approve {0}...
fr_fr: Lancer sur la passerelle : openclaw devices approve {0}...
pt_br: Execute no Gateway: openclaw devices approve {0}...
zh_cn: 在网关上运行: openclaw devices approve {0}...
zh_tw: 在閘道器上執行: openclaw devices approve {0}...

# Toast_CopyPairingCommand
source: Copy approval command
fr_fr: Copier la commande d'approbation
pt_br: Copiar comando de aprovação
zh_cn: 复制批准命令
zh_tw: 複製核准命令

# Toast_PairingCommandCopied
source: Pairing command copied
fr_fr: Commande de jumelage copiée
pt_br: Comando de pareamento copiado
zh_cn: 配对命令已复制
zh_tw: 配對命令已複製

# Toast_PairingRequestTitle
source: Pairing request
fr_fr: Demande de jumelage
pt_br: Solicitação de pareamento
zh_cn: 配对请求
zh_tw: 配對要求

# Toast_PairingRequestBody
source: {0} wants to connect
fr_fr: {0} souhaite se connecter
pt_br: {0} quer se conectar
zh_cn: {0} 想要连接
zh_tw: {0} 想要連線

# Toast_PairingRequestBodyNode
source: {0} wants to connect as a node
fr_fr: {0} souhaite se connecter en tant que nœud
pt_br: {0} quer se conectar como Node
zh_cn: {0} 想要作为节点连接
zh_tw: {0} 想要作為節點連線

# Toast_PairingReview
source: Review
fr_fr: Examiner
pt_br: Revisar
zh_cn: 查看
zh_tw: 檢視

# Toast_PairingApprovedTitle
source: Pairing approved
fr_fr: Jumelage approuvé
pt_br: Pareamento aprovado
zh_cn: 配对已批准
zh_tw: 配對已核准

# Toast_PairingApprovedBody
source: {0} can now connect
fr_fr: {0} peut désormais se connecter
pt_br: {0} agora pode se conectar
zh_cn: {0} 现在可以连接
zh_tw: {0} 現在可以連線

# Toast_PairingRejectedTitle
source: Pairing rejected
fr_fr: Jumelage refusé
pt_br: Pareamento rejeitado
zh_cn: 配对已拒绝
zh_tw: 配對已拒絕

# Toast_PairingRejectedBody
source: {0} was not allowed to connect
fr_fr: {0} n'a pas été autorisé à se connecter
pt_br: {0} não teve permissão para se conectar
zh_cn: {0} 未获允许连接
zh_tw: {0} 未獲允許連線

# PairingApproval_WindowTitle
source: Pairing request
fr_fr: Demande de jumelage
pt_br: Solicitação de pareamento
zh_cn: 配对请求
zh_tw: 配對要求

# PairingApproval_DeviceHeading
source: A device wants to connect
fr_fr: Un appareil souhaite se connecter
pt_br: Um dispositivo quer se conectar
zh_cn: 有设备想要连接
zh_tw: 有裝置想要連線

# PairingApproval_NodeHeading
source: A node wants to connect
fr_fr: Un nœud souhaite se connecter
pt_br: Um Node quer se conectar
zh_cn: 有节点想要连接
zh_tw: 有節點想要連線

# PairingApproval_Subtitle
source: Only approve if you recognize this request. You can remove it later in Connection settings.
fr_fr: N'approuvez que si vous reconnaissez cette demande. Vous pourrez la supprimer plus tard dans les paramètres de connexion.
pt_br: Aprove somente se você reconhecer esta solicitação. Você poderá removê-la posteriormente nas configurações de conexão.
zh_cn: 仅在您认识此请求时才批准。稍后可在“连接”设置中将其移除。
zh_tw: 僅在您認得此要求時才核准。稍後可在「連線」設定中將其移除。

# PairingApproval_AccessRequested
source: Access requested
fr_fr: Accès demandé
pt_br: Acesso solicitado
zh_cn: 请求的访问权限
zh_tw: 要求的存取權限

# PairingApproval_RepairBadge
source: Re-pair request: the device token will rotate.
fr_fr: Demande de réappairage: le jeton de l'appareil sera renouvelé.
pt_br: Solicitação de novo pareamento: o token do dispositivo será renovado.
zh_cn: 重新配对请求……设备令牌将轮换。
zh_tw: 重新配對要求……裝置權杖將輪替。

# PairingApproval_Approve
source: Approve
fr_fr: Approuver
pt_br: Aprovar
zh_cn: 批准
zh_tw: 核准

# PairingApproval_ApproveDevice
source: Approve device
fr_fr: Approuver l'appareil
pt_br: Aprovar dispositivo
zh_cn: 批准设备
zh_tw: 核准裝置

# PairingApproval_ApproveNode
source: Approve node
fr_fr: Approuver le nœud
pt_br: Aprovar Node
zh_cn: 批准节点
zh_tw: 核准節點

# PairingApproval_Reject
source: Reject
fr_fr: Refuser
pt_br: Rejeitar
zh_cn: 拒绝
zh_tw: 拒絕

# PairingApproval_Later
source: Decide later
fr_fr: Décider plus tard
pt_br: Decidir mais tarde
zh_cn: 稍后决定
zh_tw: 稍後決定

# PairingApproval_MoreWaiting
source: {0} more waiting
fr_fr: {0} en attente
pt_br: Mais {0} aguardando
zh_cn: 还有 {0} 个等待
zh_tw: 還有 {0} 個等待

# PairingApproval_ApproveHint
source: Approve becomes available in a moment
fr_fr: L'approbation sera disponible dans un instant
pt_br: A opção Aprovar ficará disponível em instantes
zh_cn: 批准将在稍后可用
zh_tw: 核准將在稍後可用

# PairingApproval_UnknownDevice
source: Unknown device
fr_fr: Appareil inconnu
pt_br: Dispositivo desconhecido
zh_cn: 未知设备
zh_tw: 未知裝置

# PairingApproval_UnknownPlatform
source: Unknown platform
fr_fr: Plateforme inconnue
pt_br: Plataforma desconhecida
zh_cn: 未知平台
zh_tw: 未知平台

# ExecApproval_WindowTitle
source: Command Approval
fr_fr: Approbation de commande
pt_br: Aprovação de comando
zh_cn: 命令批准
zh_tw: 命令核准

# ExecApproval_Heading
source: Allow Command?
fr_fr: Autoriser la commande ?
pt_br: Permitir comando?
zh_cn: 允许命令？
zh_tw: 允許命令？

# ExecApproval_Body
source: The following command is requesting permission to run:
fr_fr: La commande suivante demande l'autorisation de s'exécuter :
pt_br: O comando a seguir está solicitando permissão para ser executado:
zh_cn: 以下命令请求运行权限：
zh_tw: 以下命令請求執行權限：

# ExecApproval_AgentLabel
source: Agent:
pt_br: Agente:
zh_cn: 代理：
zh_tw: 代理：

# ExecApproval_CwdLabel
source: Working directory:
fr_fr: Répertoire de travail :
pt_br: Diretório de trabalho:
zh_cn: 工作目录：
zh_tw: 工作目錄：

# ExecApproval_ExecutableLabel
source: Executable:
fr_fr: Exécutable :
pt_br: Executável:
zh_cn: 可执行文件：
zh_tw: 可執行檔：

# ExecApproval_AllowOnce
source: Allow Once
fr_fr: Autoriser une fois
pt_br: Permitir uma vez
zh_cn: 允许一次
zh_tw: 允許一次

# ExecApproval_AllowAlways
source: Allow Always
fr_fr: Toujours autoriser
pt_br: Permitir sempre
zh_cn: 始终允许
zh_tw: 一律允許

# ExecApproval_Deny
source: Deny
fr_fr: Refuser
pt_br: Negar
zh_cn: 拒绝
zh_tw: 拒絕

# ExecApproval_ArmHint
source: Allow becomes available in a moment
fr_fr: L'autorisation sera disponible dans un instant
pt_br: A opção Permitir ficará disponível em instantes
zh_cn: 允许按钮稍后可用
zh_tw: 允許按鈕稍後可用

# ExecApproval_ScrollHint
source: Scroll to the end of the command before allowing
fr_fr: Faites défiler jusqu'à la fin de la commande avant d'autoriser
pt_br: Role até o final do comando antes de permitir sua execução
zh_cn: 请滚动到命令末尾后再允许
zh_tw: 請捲動至命令結尾後再允許

# ExecApproval_ConfusableWarning
source: This command mixes character sets and may not read the way it looks. Check it carefully.
fr_fr: Cette commande mélange des jeux de caractères et peut ne pas être ce qu'elle paraît. Vérifiez-la attentivement.
pt_br: Este comando mistura conjuntos de caracteres e pode não ser exibido como parece. Verifique-o cuidadosamente.
zh_cn: 此命令混用了不同的字符集，可能与其外观不符。请仔细核对。
zh_tw: 此命令混用了不同的字元集，可能與其外觀不符。請仔細核對。

# Toast_NodePaired
source: ✅ Node Paired!
fr_fr: ✅ Noeud appairé!
pt_br: ✅ Node pareado!
zh_cn: ✅ 节点已配对！
zh_tw: ✅ 節點已配對！

# Toast_NodePairedDetail
source: This PC can now receive commands from the agent
fr_fr: Ce PC peut désormais recevoir des commandes de l'agent
pt_br: Este PC agora pode receber comandos do agente
zh_cn: 此电脑现在可以接收来自代理的命令
zh_tw: 此電腦現在可以接收來自代理的命令

# Toast_PairingRejected
source: ❌ Pairing Rejected
fr_fr: ❌ Appairage refusé
pt_br: ❌ Pareamento rejeitado
zh_cn: ❌ 配对被拒绝
zh_tw: ❌ 節點配對遭拒

# Toast_PairingRejectedDetail
source: The gateway rejected this device pairing request.
fr_fr: La passerelle a rejeté la demande d'appairage de cet appareil.
pt_br: O Gateway rejeitou esta solicitação de pareamento do dispositivo.
zh_cn: 网关拒绝了此设备的配对请求。
zh_tw: 閘道器拒絕了此裝置的配對請求。

# Toast_HealthCheck
source: Health Check
fr_fr: Vérification de l'état
pt_br: Verificação do sistema
zh_cn: 健康检查
zh_tw: 健康檢查

# Toast_HealthCheckNotConnected
source: Gateway is not connected yet.
fr_fr: La passerelle n'est pas encore connectée.
pt_br: O Gateway ainda não está conectado.
zh_cn: 网关尚未连接。
zh_tw: 閘道器尚未連線。

# Toast_HealthCheckSent
source: Health check request sent.
fr_fr: Vérification de l'état envoyé.
pt_br: Solicitação de verificação do sistema enviada.
zh_cn: 健康检查请求已发送。
zh_tw: 健康檢查請求已發送。

# Toast_HealthCheckFailed
source: Health Check Failed
fr_fr: Vérification de l'état échouée
pt_br: Falha na verificação do sistema
zh_cn: 健康检查失败
zh_tw: 健康檢查失敗

# Toast_ScreenCaptured
source: 📸 Capturing screen
fr_fr: 📸 Capture de l’écran en cours
pt_br: 📸 Capturando a tela
zh_cn: 📸 正在捕获屏幕
zh_tw: 📸 正在擷取螢幕

# Toast_ScreenCapturedDetail
source: OpenClaw agent is capturing your screen
fr_fr: L’agent OpenClaw capture votre écran
pt_br: O agente do OpenClaw está capturando sua tela
zh_cn: OpenClaw 代理正在捕获您的屏幕
zh_tw: OpenClaw 代理正在擷取您的螢幕

# Toast_CameraCaptured
source: 📷 Capturing webcam photo
fr_fr: 📷 Capture d’une photo par webcam
pt_br: 📷 Capturando foto da webcam
zh_cn: 📷 正在拍摄摄像头照片
zh_tw: 📷 正在拍攝攝影機照片

# Toast_CameraCapturedDetail
source: OpenClaw agent is capturing a photo from your camera
fr_fr: L’agent OpenClaw capture une photo avec votre caméra
pt_br: O agente do OpenClaw está capturando uma foto da sua câmera
zh_cn: OpenClaw 代理正在使用您的摄像头拍摄照片
zh_tw: OpenClaw 代理正在使用您的攝影機拍攝照片

# Toast_LocationRead
source: 📍 Accessing location
fr_fr: 📍 Accès à la localisation
pt_br: 📍 Acessando localização
zh_cn: 📍 正在访问位置
zh_tw: 📍 正在存取位置

# Toast_LocationReadDetail
source: OpenClaw agent is accessing your device location
fr_fr: L’agent OpenClaw accède à la localisation de votre appareil
pt_br: O agente do OpenClaw está acessando a localização do seu dispositivo
zh_cn: OpenClaw 代理正在访问您的设备位置
zh_tw: OpenClaw 代理正在存取您的裝置位置

# Toast_CameraBlocked
source: 📷 Camera access blocked
fr_fr: 📷 Accès à la caméra bloqué
pt_br: 📷 Acesso à câmera bloqueado
zh_cn: 📷 相机访问被阻止
zh_tw: 📷 相機訪問被阻止

# Toast_CameraBlockedDetail
source: Enable camera access in Windows Privacy settings for OpenClaw Tray
fr_fr: Activez l'accès à la caméra dans les paramètres de confidentialité de Windows pour OpenClaw Tray
pt_br: Ative o acesso à câmera nas configurações de privacidade do Windows para o OpenClaw Tray
zh_cn: 请在 Windows 隐私设置中为 OpenClaw Tray 启用相机访问
zh_tw: 請在 Windows 隱私設定中為 OpenClaw Tray 啟用相機訪問

# Toast_ScreenRecordingStarted
source: 🔴 Screen Recording Started
fr_fr: 🔴 Enregistrement d'écran démarré
pt_br: 🔴 Gravação de tela iniciada
zh_cn: 🔴 屏幕录制已开始
zh_tw: 🔴 螢幕錄製已開始

# Toast_ScreenRecordingStartedDetail
source: OpenClaw agent is recording your screen
fr_fr: L'agent OpenClaw enregistre votre écran
pt_br: O agente do OpenClaw está gravando sua tela
zh_cn: OpenClaw 代理正在录制您的屏幕
zh_tw: OpenClaw 代理正在錄製您的螢幕

# Toast_ScreenRecordingComplete
source: ✅ Screen Recording Complete
fr_fr: ✅ Enregistrement d'écran terminé
pt_br: ✅ Gravação de tela concluída
zh_cn: ✅ 屏幕录制已完成
zh_tw: ✅ 螢幕錄製已完成

# Toast_ScreenRecordingCompleteDetail
source: Screen recording has been sent to the agent
fr_fr: L'enregistrement d'écran a été envoyé à l'agent
pt_br: A gravação de tela foi enviada ao agente
zh_cn: 屏幕录制已发送给代理
zh_tw: 螢幕錄製已傳送給代理

# Toast_ScreenRecordingFailed
source: ❌ Screen Recording Failed
fr_fr: ❌ Échec de l'enregistrement d'écran
pt_br: ❌ Falha na gravação de tela
zh_cn: ❌ 屏幕录制失败
zh_tw: ❌ 螢幕錄製失敗

# Toast_ScreenRecordingFailedDetail
source: An error occurred while recording the screen
fr_fr: Une erreur est survenue lors de l'enregistrement de l'écran
pt_br: Ocorreu um erro durante a gravação da tela
zh_cn: 录制屏幕时发生错误
zh_tw: 錄製螢幕時發生錯誤

# Toast_CameraRecordingStarted
source: 🔴 Camera Recording Started
fr_fr: 🔴 Enregistrement caméra démarré
pt_br: 🔴 Gravação da câmera iniciada
zh_cn: 🔴 摄像头录制已开始
zh_tw: 🔴 攝影機錄製已開始

# Toast_CameraRecordingStartedDetail
source: OpenClaw agent is recording from your camera
fr_fr: L'agent OpenClaw enregistre depuis votre caméra
pt_br: O agente do OpenClaw está gravando com sua câmera
zh_cn: OpenClaw 代理正在从您的摄像头录制
zh_tw: OpenClaw 代理正在從您的攝影機錄製

# Toast_CameraRecordingComplete
source: ✅ Camera Recording Complete
fr_fr: ✅ Enregistrement caméra terminé
pt_br: ✅ Gravação da câmera concluída
zh_cn: ✅ 摄像头录制已完成
zh_tw: ✅ 攝影機錄製已完成

# Toast_CameraRecordingCompleteDetail
source: Camera clip has been sent to the agent
fr_fr: Le clip caméra a été envoyé à l'agent
pt_br: O clipe da câmera foi enviado ao agente
zh_cn: 摄像头录制片段已发送给代理
zh_tw: 攝影機錄製片段已傳送給代理

# RecordingConsent_WindowTitle
source: Permission Request
fr_fr: Demande d'autorisation
pt_br: Solicitação de permissão
zh_cn: 权限请求
zh_tw: 權限請求

# RecordingConsent_ScreenTitle
source: Allow screen capture?
fr_fr: Autoriser la capture d'écran ?
pt_br: Permitir captura de tela?
zh_cn: 允许屏幕捕获？
zh_tw: 允許螢幕擷取？

# RecordingConsent_CameraTitle
source: Allow camera capture?
fr_fr: Autoriser la capture par la caméra ?
pt_br: Permitir captura da câmera?
zh_cn: 允许摄像头捕获？
zh_tw: 允許攝影機擷取？
